testEdo/Labs/Lab04-heatTransfer/combustor2D-BBP/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
	value		uniform 0;
    }
    outlet
    {
        type            calculated;
	value		uniform 0.0;
    }
    splitter
    {
        type            calculated;
	value		uniform 0.0;
    }
    fuel_inlet
    {
        type            calculated;
	value		uniform 0.0;
    }

    back
    {
        type            calculated;
	value		uniform 0.0;
    }
    sides
    {
	type		calculated;
	value		uniform 0.0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
