testEdo/Labs/Lab04-heatTransfer/combustor2D-BBP/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
//    grad(U)	cellLimited	Gauss	linear	1;
}

divSchemes
{
    	default         none;
    	div(phi,U)      			Gauss upwind;
    	div(phi,k)      			Gauss upwind;
    	div(phi,epsilon) 			Gauss upwind;
    	div(phi,omega)  			Gauss limitedLinear 1;
//    div(phi,v2)     Gauss limitedLinear 1;
    	div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;
//    div(nonlinearStress) Gauss linear;
    	div(phi,e)				Gauss upwind;
	div(phi,K)				Gauss linear;
	div(phiv,p)				Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
